[
    {
        "title": "A Mexican man who spoke no English went into a department store to buy socks.",
        "content": "A Mexican man who spoke no English went into a department store to buy socks. He found his way to the menswear department where a young lady offered to help him. 'Quiero calcetines,' said the man. 'I don't speak Spanish, but we have some very nice suits over here,' said the salesgirl. 'No, no quiero trajes. Quiero calcetines,' said the man. 'Well, these shirts are on sale this week,' declared the salesgirl. 'No, no quiero camisas. Quiero calcetines,' repeated the man. 'I still don't know what you're trying to say. We have some fine pants on this rack,' offered the salesgirl. 'No, no quiero pantalones. Quiero calcetines,' insisted the man. 'These sweaters are top quality,' the salesgirl probed. 'No, no quiero sueter. Quiero calcetines,' said the man. 'Our undershirts are over here,' fumbled the salesgirl, beginning to lose patience. 'No, no quiero camisetas. Quiero calcetines,' the man repeated. As they passed the underwear counter, the man spotted a display of socks and happily grabbed a pair. Holding them up he proclaimed, 'Eso sí que es!' 'Why didn't you just spell it in the first place?!' yelled the salesgirl.",
        "resource": "https://www.reddit.com/r/Jokes/comments/jxw4mw/a_mexican_man_who_spoke_no_english_went_into_a/",
        "explaination": "'Eso sí que es' sounds very similar to spelling socks.",
        "tags": ["spanish", "homophonic"]
    },
    {
        "title": "A wife decides to take her husband, Dave, to a strip club for his birthday.",
        "content": "They arrive at the club and the doorman says, 'Hey, Dave! How ya doin'?' His wife is puzzled and asks if hes been to this club before. 'Oh no,' says Dave. 'Hes on my bowling team.' When they are seated, a waitress asks Dave if hed like his usual and brings over a Budweiser. His wife is becoming increasingly uncomfortable and says,'How did she know that you drink Budweiser?' 'Shes in the Ladies Bowling League, honey. We share lanes with them.' A stripper then comes over to their table, throws her arms around Dave, and says 'Hi Davey. Want your usual table dance, big boy?' Daves wife, now furious, grabs her purse and storms out of the club. Dave follows and spots her getting into a cab. Before she can slam the door, he jumps in beside her. He tries desperately to explain how the stripper must have mistaken him for someone else, but his wife is having none of it. She is screaming at him at the top of her lungs, calling him every name in the book. The cabby turns his head and says, 'Looks like you picked up a real bitch tonight, Dave.'",
        "resource": "https://www.reddit.com/r/Jokes/comments/k1gybx/a_wife_decides_to_take_her_husband_dave_to_a/"
    },
    {
        "title": "Dave knows everybody and everybody knows Dave.",
        "content": "It's really simple: Dave knows everybody and everybody knows Dave. Dave was bragging to his boss one day, 'You know, I know everyone there is to know. Just name someone, anyone, and I know them.' Tired of his boasting, his boss called his bluff, 'OK, Dave, how about Tom Cruise?' 'No dramas boss, Tom and I are old friends, and I can prove it.' So Dave and his boss fly out to Hollywood and knock on Tom Cruise's door, and Tom Cruise shouts, 'Dave! What's happening? Great to see you! Come on in for a beer!' Although impressed, Dave's boss is still skeptical. After they leave Cruise's house, he tells Dave that he thinks him knowing Cruise was just lucky. 'No, no, just name anyone else,' Dave says. 'President Trump,' his boss quickly retorts. 'Yup,' Dave says, 'Old buddies, let's fly out to Washington,' and off they go. At the White House, Trump spots Dave on the tour and motions him and his boss over, saying, 'Dave, what a surprise, I was just on my way to a meeting, but you and your friend come on in and let's have a beer first and catch up.' Well, the boss is very shaken by now but still not totally convinced. After they leave the White House grounds he expresses his doubts to Dave, who again implores him to name anyone else. 'Pope Francis,' his boss replies. 'Sure!' says Dave. 'I've known the Pope for years.' So off they fly to Rome. Dave and his boss are assembled with the masses at the Vatican's St. Peter's Square when Dave says, 'This will never work. I can't catch the Pope's eye among all these people. Tell you what, I know all the guards so let me just go upstairs and I'll come out on the balcony with the Pope.' He disappears into the crowd headed towards the Vatican. Sure enough, half an hour later Dave emerges with the Pope on the balcony, but by the time Dave returns, he finds that his boss has had a heart attack and is surrounded by paramedics. Making his way to his boss' side, Dave asks him, 'What happened?' His boss looks up and says, 'It was the final straw... you and the Pope came out on to the balcony and the man standing next to me said, 'Who the fuck is that on the balcony with Dave?'",
        "resource": "https://www.reddit.com/r/Jokes/comments/k1gybx/a_wife_decides_to_take_her_husband_dave_to_a/"
    }
]
